trunk/CrazyBid/app/views/bids/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
<%	if session["warden.user.user.key"][1][0]>=1 %>
<% product = Product.find(@bid.product_id.to_s)%>