CrazyBid/app/controllers/user_bids_controller.rb

  def index
    @user_bids = UserBid.all
---
SELECT "user_bids".* FROM "user_bids"

  def show
    @user_bid = UserBid.find(params[:id])
---
SELECT "user_bids".* FROM "user_bids" WHERE "user_bids"."id" = ? LIMIT 1  [["id", "1"]]

  def edit
    @user_bid = UserBid.find(params[:id])
---
SELECT "user_bids".* FROM "user_bids" WHERE "user_bids"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @user_bid = UserBid.new(params[:user_bid])

    respond_to do |format|
      if @user_bid.save
---
INSERT INTO "user_bids" ("bid_id", "created_at", "time", "updated_at", "user_id", "user_price") VALUES (?, ?, ?, ?, ?, ?)