trunk/CrazyBid/app/controllers/bids_controller.rb

SELECT "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @bid = Bid.find(params[:id])
    @product = Product.find(@bid.product_id)

SELECT "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @bid = Bid.find(params[:id])

INSERT INTO "bids" ("bid_end_time", "bid_start_time", "bid_tax", "bid_unit_cost", "created_at", "product_id", "transaction_status", "updated_at", "winner_user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @bid = Bid.new(params[:bid])

    respond_to do |format|
      if @bid.save

SELECT "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "bids" SET "bid_tax" = 100, "bid_unit_cost" = 100, "transaction_status" = 'Ready', "bid_start_time" = '2012-10-09 01:57:00.000000', "bid_end_time" = '2012-10-09 01:57:00.000000', "updated_at" = '2012-10-09 01:57:23.054882' WHERE "bids"."id" = 1
---
  def update
    @bid = Bid.find(params[:id])

    respond_to do |format|
      if @bid.update_attributes(params[:bid])

SELECT "bids".* FROM "bids" WHERE "bids"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "user_bids" WHERE "user_bids"."id" = ?  [["id", 1]]
---
  def destroy
    @bid = Bid.find(params[:id])
    @bid.destroy