trunk/CrazyBid/app/controllers/products_controller.rb

INSERT INTO "products" ("created_at", "product_description", "product_name", "product_price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 09 Oct 2012 03:16:21 UTC +00:00], ["product_description", "23w3"], ["product_name", "abc"], ["product_price", 3], ["updated_at", Tue, 09 Oct 2012 03:16:21 UTC +00:00]]
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save(params[:product][:updata])