trunk/CrazyBid/app/controllers/user_bids_controller.rb

SELECT "user_bids".* FROM "user_bids" WHERE "user_bids"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @user_bid = UserBid.find(params[:id])

INSERT INTO "user_bids" ("bid_id", "created_at", "time", "updated_at", "user_id", "user_price") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    if(user_signed_in?)
      if(params[:user_bid][:user_price]=="")
        params[:user_bid][:user_price]=0;
      end
      params[:user_bid][:time] = DateTime.now;
      params[:user_bid][:user_id]=current_user.id;
      @user_bid = UserBid.new(params[:user_bid]);
      @bid = Bid.find(:first,:conditions=>{:id=>params[:user_bid][:bid_id],:transaction_status=>"1"});
      remain = current_user.user_balance - @bid.bid_unit_cost;
      if(remain >=0)
      current_user.update_attributes(:user_balance=>remain);
      @user_bid.save;